schnoog/joystick_F16_sidestick/boards.txt
microF16Stick.upload.tool=avrdude
microF16Stick.upload.protocol=avr109
microF16Stick.upload.maximum_size=28672
microF16Stick.upload.maximum_data_size=2560
microF16Stick.upload.speed=57600
microF16Stick.upload.disable_flushing=true
microF16Stick.upload.use_1200bps_touch=true
microF16Stick.upload.wait_for_upload_port=true

microF16Stick.bootloader.tool=avrdude
microF16Stick.bootloader.low_fuses=0xff
microF16Stick.bootloader.high_fuses=0xd8
microF16Stick.bootloader.extended_fuses=0xcb
microF16Stick.bootloader.file=caterina/Caterina-microF16Stick.hex
microF16Stick.bootloader.unlock_bits=0x3F
microF16Stick.bootloader.lock_bits=0x2F

microF16Stick.build.mcu=atmega32u4
microF16Stick.build.f_cpu=16000000L

microF16Stick.build.vid=0x8798
microF16Stick.build.pid=0x8037
microF16Stick.build.usb_product="F16-Stick"

microF16Stick.build.board=AVR_MICRO
microF16Stick.build.core=arduino
microF16Stick.build.variant=micro
microF16Stick.build.extra_flags={build.usb_flags}


##############################################################

microF16ICP.name=Arduino Micro F16-ICP

microF16ICP.vid.0=0x2341
microF16ICP.pid.0=0x0037
microF16ICP.vid.1=0x2341
microF16ICP.pid.1=0x8037
microF16ICP.vid.2=0x2A03
microF16ICP.pid.2=0x0037
microF16ICP.vid.3=0x2A03
microF16ICP.pid.3=0x8037
microF16ICP.vid.4=0x2341
microF16ICP.pid.4=0x0237
microF16ICP.vid.5=0x2341
microF16ICP.pid.5=0x8237

microF16ICP.upload.tool=avrdude
microF16ICP.upload.protocol=avr109
microF16ICP.upload.maximum_size=28672
microF16ICP.upload.maximum_data_size=2560
microF16ICP.upload.speed=57600
microF16ICP.upload.disable_flushing=true
microF16ICP.upload.use_1200bps_touch=true
microF16ICP.upload.wait_for_upload_port=true

microF16ICP.bootloader.tool=avrdude
microF16ICP.bootloader.low_fuses=0xff
microF16ICP.bootloader.high_fuses=0xd8
microF16ICP.bootloader.extended_fuses=0xcb
microF16ICP.bootloader.file=caterina/Caterina-microF16ICP.hex
microF16ICP.bootloader.unlock_bits=0x3F
microF16ICP.bootloader.lock_bits=0x2F

microF16ICP.build.mcu=atmega32u4
microF16ICP.build.f_cpu=16000000L


microF16ICP.build.vid=0x8798
microF16ICP.build.pid=0x8057
microF16ICP.build.usb_product="F16-ICP"


microF16ICP.build.board=AVR_MICRO
microF16ICP.build.core=arduino
microF16ICP.build.variant=micro
microF16ICP.build.extra_flags={build.usb_flags}

##############################################################

microThrottle.name=Arduino Micro Throttle

microThrottle.vid.0=0x2341
microThrottle.pid.0=0x0037
microThrottle.vid.1=0x2341
microThrottle.pid.1=0x8037
microThrottle.vid.2=0x2A03
microThrottle.pid.2=0x0037
microThrottle.vid.3=0x2A03
microThrottle.pid.3=0x8037
microThrottle.vid.4=0x2341
microThrottle.pid.4=0x0237
microThrottle.vid.5=0x2341
microThrottle.pid.5=0x8237

microThrottle.upload.tool=avrdude
microThrottle.upload.protocol=avr109
microThrottle.upload.maximum_size=28672
microThrottle.upload.maximum_data_size=2560
microThrottle.upload.speed=57600
microThrottle.upload.disable_flushing=true
microThrottle.upload.use_1200bps_touch=true
microThrottle.upload.wait_for_upload_port=true

microThrottle.bootloader.tool=avrdude
microThrottle.bootloader.low_fuses=0xff
microThrottle.bootloader.high_fuses=0xd8
microThrottle.bootloader.extended_fuses=0xcb
microThrottle.bootloader.file=caterina/Caterina-microThrottle.hex
microThrottle.bootloader.unlock_bits=0x3F
microThrottle.bootloader.lock_bits=0x2F

microThrottle.build.mcu=atmega32u4
microThrottle.build.f_cpu=16000000L

microThrottle.build.vid=0x8798
microThrottle.build.pid=0x8798
microThrottle.build.usb_product="Schnoog Throttle"

microThrottle.build.board=AVR_MICRO
microThrottle.build.core=arduino
microThrottle.build.variant=micro
microThrottle.build.extra_flags={build.usb_flags}